---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooManyElementsInSketch
source: html/1c6d3046-c762-8656-1cd3-173f05c7a5af.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooManyElementsInSketch Property

Sketch of <element> contains too many objects - it may take long time to solve.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyElementsInSketch { get; }
```